artillery/socketio-local.yml
---
config:
  target: http://localhost:3000
  phases:
  - duration: 1
    arrivalRate: 1
scenarios:
- name: Test connection scenario
  engine: socketio
  socketio:
    extraHeaders:
      Authorization: Bearer eyJ0eXAiOiJKV1QiLCJraWQiOiI1ZzI2ejVPelpUSWtoMVErVnU5N0owb1htQTQ9IiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJqZW5pdXNfdXNlcnN5bmMwMDVAc2l0LmNvbSIsImN0cyI6Ik9BVVRIMl9TVEFURUxFU1NfR1JBTlQiLCJhdXRoX2xldmVsIjowLCJhdWRpdFRyYWNraW5nSWQiOiI1YjEzNTdhYy1jNDc5LTQ1MjctYjAyZi1kYzgyNDg3Y2VjM2UtMTE5MjQ4NCIsImlzcyI6Imh0dHA6Ly9vYW1zaXQuZGV2LmNvcnAuYnRwbi5jby5pZC9vcGVuYW0vb2F1dGgyL3JlYWxtcy9yb290L3JlYWxtcy9qZW5pdXMiLCJ0b2tlbk5hbWUiOiJhY2Nlc3NfdG9rZW4iLCJ0b2tlbl90eXBlIjoiQmVhcmVyIiwiYXV0aEdyYW50SWQiOiJQcThMUEoxT2xscWlXU0pYN2Z0MTFIanE1dHciLCJub25jZSI6InJhbmRvbSIsImF1ZCI6Implbml1cyIsIm5iZiI6MTY0Njg5NjYwMSwiZ3JhbnRfdHlwZSI6ImF1dGhvcml6YXRpb25fY29kZSIsInNjb3BlIjpbIm9wZW5pZCIsInByb2ZpbGUiLCJsb2dpbjpwYXNzd29yZCIsImxzZWMiXSwiYXV0aF90aW1lIjoxNjQ2ODk2NjAxLCJyZWFsbSI6Ii9qZW5pdXMiLCJleHAiOjE3NDY4OTY5MDEsImlhdCI6MTY0Njg5NjYwMSwiZXhwaXJlc19pbiI6MzAwLCJqdGkiOiJrTEdUOUR0SDhJbEN5eWNLQVpIMDhPMWU3eWcifQ.MU-7QQ__TJ5VBmAEg2CluAmSiSX7HYIvA2gwme3gbBAMP_2r5QXD_bvQgxD3VcdNFcVuIcwNRRimR_HQgGnRcrPlVgb7wRXYXMsOcfxD1npm9UlzIuPRZx74qPcOmdx0oc-cDQV0BB_8j08G9pPJhWUzFJjjQyaWkhr-0thz6QDjlBrW323EC2RPh-pM8W3uan0lPuRGEa-zStrFAAxtuI2ZXinXgX2q9VuSHdD7YCmW-UeMQWNQGsJv4cQDAhXNiQN5rMDiuhH3mI-j4jJDGiG6WZnRIFgx6PxO2CHay1kwSFh9iCh0dAqZloNUmUVznfz5K2mXkEbM-wmLlHIF0rJELuYvEvaWLKkeVnQ0vQ8nJYJdPxh1A-4hm0ZNKwc5MltzwIFKJ3Fi2kg3TCANAZIe7hIEz8fpvcwAiAOJ8W3RBkUmlHumtdzottE292EEkH8QrZD3_-x3Xr5Egmgy35fJ7_FB_-7MNRvR7mv8g8wB_65WGymYqKI5EXnX94DaKg_IqyL1CFMEeHFwB3dg4RUuo3pK0GrMFvxa0uTDMkFwtFGP9j34JSWZo6eQSgFixkraVfqvjU6uwfcneRqelwfyRM0rQKCqrCXkBa984hcTYOw2Qle81jWKAgh9BKUjPV8CGlKxJ5U4vqSrz8Lh81Wo2kCuas16DZUNTQ9Ut64
      x-id-token: eyJ0eXAiOiJKV1QiLCJraWQiOiI1ZzI2ejVPelpUSWtoMVErVnU5N0owb1htQTQ9IiwiYWxnIjoiUlMyNTYifQ.eyJhdF9oYXNoIjoiempyMnliTHlXaXJ1QmFBQ1pWTC1kUSIsInN1YiI6Implbml1c191c2Vyc3luYzAwNUBzaXQuY29tIiwiY2lmIjoiNTg3MEQ2IiwidGVsZXBob25lTnVtYmVyIjoiKzYyODk4NzcyMTMyNSIsImF1ZGl0VHJhY2tpbmdJZCI6IjViMTM1N2FjLWM0NzktNDUyNy1iMDJmLWRjODI0ODdjZWMzZS0xMTkxNjIxIiwiaXNzIjoiaHR0cDovL29hbXNpdC5kZXYuY29ycC5idHBuLmNvLmlkL29wZW5hbS9vYXV0aDIvcmVhbG1zL3Jvb3QvcmVhbG1zL2plbml1cyIsInRva2VuTmFtZSI6ImlkX3Rva2VuIiwidWlkIjoiNzQ0MjE3ZGQtZWNlZC00OTM5LTg1M2EtOTgyOWUwYmQyMGQwIiwiYWNyIjoiMCIsImNhc2h0YWciOiJ1c2Vyc3luYzAwNSIsImF6cCI6Implbml1cyIsImF1dGhfdGltZSI6MTY0Njg5NjI0NCwicGFzc3dvcmRSZXNldCI6ImZhbHNlIiwiZXhwIjoxNzQ2ODk2NTQ0LCJpYXQiOjE2NDY4OTYyNDQsImVtYWlsIjoiamVuaXVzX3VzZXJzeW5jMDA1QHNpdC5jb20iLCJhdmF0YXJVcmwiOiI3MzY4MzNjNDlhMzQ1ZTY0ZDBmZjMyZjI2ZTkwMGYzNzk0YTg4ZjFkL3B1YmxpYy1hdmF0YXIvc2VsZi8yMDIyLTAzLTEwVDA3OjA0OjMzLjM0MFouanBlZyIsImNuIjoiQ1VTVE9NRVIgNTg3MEQ2IiwiYWNjb3VudE51bWJlciI6IjkwMzcwMDAwNDcyIiwibm9uY2UiOiJyYW5kb20iLCJqZW5pdXMiOiJzOk5PUk1BTCxhOjVjYWMzNzA3ODVjMzc5NDRhYTNiNjUzMjYzMzEyMzhhLGE6MjUwY2NkYjVhZjdkZWViNTc3OTI2YmI3NDk0ODJkYjQsYTpiNDQ0N2Y1NzQzNjA1MjUzNzcyYTgyYjc0NTkxMjA1ZSxhOjU1NmFjN2NlMmEzNDZkMWE3MmNkOGM3MGIwMDM3ZGUzLGE6ZmNjZWNjYWVmOGFjNjEyZTcwMWQ1MzBjYzk2NTlmYjciLCJhdWQiOiJqZW5pdXMiLCJjX2hhc2giOiJ4QlZ4c1JueEg4XzFNYS1HWFBWa2JRIiwib3JnLmZvcmdlcm9jay5vcGVuaWRjb25uZWN0Lm9wcyI6InRBRWRtd2VXTEV6SXMyZHNsS3FQY3RHWlNUYyIsInJlYWxtIjoiL2plbml1cyIsInRva2VuVHlwZSI6IkpXVFRva2VuIn0.riwFE5oah0ZTTMnV8_0Vgvq8hPkt8t_3tCGrbnFLWzUrQc2XeGX5bWGGhDwf-W9ctqBdVwYevtHLMnBBMC0yNcnl7fsZE1fgJR50-UPKhmx7ujgty0YxS1HBld-l8KIpfmzyn2oeqMWbWo5DHFuvyqGl_xpHS58qBLU2kIWnfYxjtvOMxKS3nss4fAch6Bk6uvig5evvon1AiW3PLD50DV9PBX2jQUCjAETHUI7-VCPpByta5N8fyIRzH4pySWeTVurauVevcNYbQrdLT7BZPWdt5D6lsiQjY0mK2wi2r6A8I4UqksD0K-8cNZwZapzZO9NbzxnnJNkr6hLONIlEA0snP1V54lFG8kCbPaIE4gQR4HLpTSiubizHdbOfNV6Mn1ecfnkAEP8gOPZx-RdiESQutme4mdEeXbD-89Msc5FLl1YHiRHUcPGIgyXptp_fr2ctqsLHBbr21sO7iWd7RwpVBO5WftYym4ZPgXDNwdhinDBmFKbzc9d6qZXiR6VKKxZf4dZYdmu59RLnlIpG-VMvpVF5LLasKVs37sgkZmVc2tO_FrWSjLJjAdsMJ6Uy3XwhjcdSrsh03hEFjA2I8mNz85_ivX4uONqwGpnF98Xp1Er_8jFlFWujggogvzxrqObLo4LGRxr5qtAvYaKJafrr6Y1EaxY3UoZbkmzbSbs
    transports:
    - websocket
    extendedMetrics: true
  flow:
  - think: 3
  - function: ./emitMessage.js
  # - emit:
  #     channel: echo
  #     data: Hello from client
  #     # response:
  #     #   channel: echoResponse
  #     #   data: Hello from server
  #     afterResponse: ./afterResponse.js
  - think: 3